#案例一：计算n的阶乘

#递归调用(先层层递进，再逐层回归，一定要有终结点)

#递归调用的运行逻辑

#jc(10) = 10 * jc(9) = 10 * 362880 = 3628800
#jc(9) = 9 * jc(8) = 9 * 40320 = 362880
#jc(8) = 8 * jc(7) = 8 * 5040 = 40320
#jc(7) = 7 * jc(6) = 7 * 720 = 5040
#jc(6) = 6 * jc(5) = 6 * 120 = 720
#jc(5) = 5 * jc(4) = 5 * 24 = 120
#jc(4) = 4 * jc(3) = 4 * 6 = 24
#jc(3) = 4 * jc(3) = 3 * 2 = 6
#jc(2) = 2 * jc(1) = 2 * 1 = 2
#jc(1) = 1

#这个运行逻辑也是遵循栈结构的(层层递进，逐层递归)

def jc(n):
    if n == 1:
        return 1
    else:
        return n * jc(n-1)

result = jc(10)
print(result)


